#include <iostream>
using namespace std;

int main() {
    int a, b, c;
    cin >> a >> b >> c;

    cout << "a + b = " << a + b << endl;
    cout << "a + c = " << a + c << endl;
    cout << "b + c = " << b + c << endl;
    cout << "a + b + c = " << a + b + c << endl;
    cout << "a * b * c = " << a * b * c << endl;

    return 0;
}

//Оголосили три цілих змінних a, b, і c.
//
//Зчитуємо значення a, b, і c з клавіатури за допомогою cin.
//
//Виводимо на екран суму a + b, суму a + c, суму b + c, та суму всіх трьох чисел a + b + c.
//
//Також виводимо добуток a * b * c.
//
//В результаті, на екран буде виведено наступне (наші результати введені з клавіатури можуть бути різними):
//


//a + b = (сума a і b)
//a + c = (сума a і c)
//b + c = (сума b і c)
//a + b + c = (сума a, b і c)  (добуток a, b і c)
//
//Наприклад, якщо ми введемо 2, 3, і 4 як значення для a, b, і c, ми побачимо такий вивід:
//
//a + b = 5
//a + c = 6
//b + c = 7
//a + b + c = 9  24
